app/Controllers/Categories.php

SELECT *
FROM `categories`
---
    public function index()
    {
        $categories = $this->categoryModel->findAll();