app/Controllers/Customers.php

    public function index()
    {
        $data = [
            'title' => 'Müşteriler',
            'customers' => $this->customerModel->findAll()
---
SELECT *
FROM `customers`