app/Controllers/Home.php

    private function getMetrics()
    {
        $totalAmount = $this->projectModel->selectSum('total_amount')->first()['total_amount'] ?? 0;
        $paidAmount = $this->projectModel->selectSum('paid_amount')->first()['paid_amount'] ?? 0;
        $pendingAmount = $totalAmount - $paidAmount;

        return [
            'totalProjects' => $this->projectModel->countAll(),
            'completedProjects' => $this->projectModel->where('status', 'Tamamlandı')->countAllResults(),
            'ongoingProjects' => $this->projectModel->where('status', 'Devam Ediyor')->countAllResults(),
            'pendingProjects' => $this->projectModel->where('status', 'Beklemede')->countAllResults(),
            'paymentPendingProjects' => $this->projectModel->where('status', 'Ödeme Bekliyor')->countAllResults(),
            'totalAmount' => $totalAmount,
            'paidAmount' => $paidAmount,
            'pendingAmount' => $pendingAmount
        ];
---
SELECT SUM(`total_amount`) AS `total_amount`
FROM `projects`
 LIMIT 1
SELECT SUM(`paid_amount`) AS `paid_amount`
FROM `projects`
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `projects`
WHERE `status` = 'Ödeme Bekliyor'
SELECT COUNT(*) AS `numrows`
FROM `projects`
WHERE `status` = 'Tamamlandı'
SELECT COUNT(*) AS `numrows`
FROM `projects`
WHERE `status` = 'Devam Ediyor'
SELECT COUNT(*) AS `numrows`
FROM `projects`
WHERE `status` = 'Beklemede'

    private function getRecentProjects($limit = 5)
    {
        return $this->projectModel
            ->select('projects.*, customers.name as customer_name')
            ->join('customers', 'customers.id = projects.customer_id')
            ->orderBy('projects.created_at', 'DESC')
            ->limit($limit)
            ->find();
---
SELECT `projects`.*, `customers`.`name` as `customer_name`
FROM `projects`
JOIN `customers` ON `customers`.`id` = `projects`.`customer_id`
ORDER BY `projects`.`created_at` DESC
 LIMIT 5

    private function getActiveProjects()
    {
        return $this->projectModel
            ->select('projects.*, customers.name as customer_name')
            ->join('customers', 'customers.id = projects.customer_id')
            ->where('projects.status !=', 'Tamamlandı')
            ->findAll();
---
SELECT `projects`.*, `customers`.`name` as `customer_name`
FROM `projects`
JOIN `customers` ON `customers`.`id` = `projects`.`customer_id`
WHERE `projects`.`status` != 'Tamamlandı'