app/Controllers/Projects.php

    public function index()
    {
        $data = [
            'title' => 'Projeler',
            'activeProjects' => $this->projectModel->select('projects.*, customers.name as customer_name, categories.name as category_name')
                                                 ->join('customers', 'customers.id = projects.customer_id')
                                                 ->join('categories', 'categories.id = projects.category_id', 'left')
                                                 ->where('projects.status !=', 'Tamamlandı')
                                                 ->orderBy('(projects.total_amount <= projects.paid_amount)', 'DESC')
                                                 ->orderBy('FIELD(projects.priority, "Acil", "Yüksek", "Orta", "Düşük")', '')
                                                 ->orderBy('projects.created_at', 'DESC')
                                                 ->findAll(),
            'completedProjects' => $this->projectModel->select('projects.*, customers.name as customer_name, categories.name as category_name')
                                                    ->join('customers', 'customers.id = projects.customer_id')
                                                    ->join('categories', 'categories.id = projects.category_id', 'left')
                                                    ->where('projects.status', 'Tamamlandı')
                                                    ->orderBy('projects.end_date', 'DESC')
                                                    ->findAll()
---
SELECT `projects`.*, `customers`.`name` as `customer_name`, `categories`.`name` as `category_name`
FROM `projects`
JOIN `customers` ON `customers`.`id` = `projects`.`customer_id`
LEFT JOIN `categories` ON `categories`.`id` = `projects`.`category_id`
WHERE `projects`.`status` != 'Tamamlandı'
ORDER BY (projects.total_amount <= projects.paid_amount) DESC, FIELD(projects.priority, "Acil", "Yüksek", "Orta", "Düşük"), `projects`.`created_at` DESC
SELECT `projects`.*, `customers`.`name` as `customer_name`, `categories`.`name` as `category_name`
FROM `projects`
JOIN `customers` ON `customers`.`id` = `projects`.`customer_id`
LEFT JOIN `categories` ON `categories`.`id` = `projects`.`category_id`
WHERE `projects`.`status` = 'Tamamlandı'
ORDER BY `projects`.`end_date` DESC