app/Controllers/Reports.php

SELECT *
FROM `categories`
SELECT *
FROM `customers`
---
    public function index()
    {
        $year = $this->request->getGet('year') ?? date('Y');
        $month = $this->request->getGet('month') ?? date('m');

        $data = [
            'title' => 'Raporlar',
            'year' => $year,
            'month' => $month,
            'years' => $this->getYears(),
            'months' => $this->getMonths(),
            'categories' => $this->categoryModel->findAll(),
            'customers' => $this->customerModel->findAll(),

SELECT *
FROM `categories`
---
    private function getCategoryStats($year, $month)
    {
        // Tüm kategorileri al
        $categories = $this->categoryModel->findAll();

SELECT *
FROM `customers`
---
    private function getCustomerAnalysis($year, $month)
    {
        // Tüm müşterileri al
        $customers = $this->customerModel->findAll();