app/Models/CategoryModel.php

SELECT COUNT(*) AS `numrows`
FROM `projects`
WHERE `category_id` = '1'
---
    public function getProjectCount($categoryId)
    {
        return $this->db->table('projects')
            ->where('category_id', $categoryId)
            ->countAllResults();