app/Models/CustomerModel.php

SELECT `customers`.*, COUNT(projects.id) as project_count, SUM(projects.total_amount) as total_amount
FROM `customers`
LEFT JOIN `projects` ON `projects`.`customer_id` = `customers`.`id`
GROUP BY `customers`.`id`
ORDER BY `project_count` DESC
 LIMIT 5
---
    public function getTopCustomers($limit = 5)
    {
        return $this->select('customers.*, COUNT(projects.id) as project_count, SUM(projects.total_amount) as total_amount')
                    ->join('projects', 'projects.customer_id = customers.id', 'left')
                    ->groupBy('customers.id')
                    ->orderBy('project_count', 'DESC')
                    ->limit($limit)
                    ->findAll();