app/Models/PaymentModel.php

    public function getRecentPayments($limit = 10)
    {
        return $this->select('payments.*, projects.name as project_name, projects.customer_id')
                    ->join('projects', 'projects.id = payments.project_id')
                    ->orderBy('payment_date', 'DESC')
                    ->limit($limit)
                    ->findAll();
---
SELECT `payments`.*, `projects`.`name` as `project_name`, `projects`.`customer_id`
FROM `payments`
JOIN `projects` ON `projects`.`id` = `payments`.`project_id`
ORDER BY `payment_date` DESC
 LIMIT 10

    public function getMonthlyPayments($year, $month)
    {
        $result = $this->selectSum('amount')
                      ->where('YEAR(payment_date)', $year)
                      ->where('MONTH(payment_date)', $month)
                      ->first();
---
SELECT SUM(`amount`) AS `amount`
FROM `payments`
WHERE YEAR(payment_date) = '2025'
AND MONTH(payment_date) = 1
 LIMIT 1

    public function getYearlyPayments($year)
    {
        $result = $this->selectSum('amount')
                      ->where('YEAR(payment_date)', $year)
                      ->first();
---
SELECT SUM(`amount`) AS `amount`
FROM `payments`
WHERE YEAR(payment_date) = '2025'
 LIMIT 1

    public function getMonthlyPaymentsTotal($year, $month)
    {
        $result = $this->selectSum('amount')
                      ->where('YEAR(payment_date)', $year)
                      ->where('MONTH(payment_date)', $month)
                      ->first();
---
SELECT SUM(`amount`) AS `amount`
FROM `payments`
WHERE YEAR(payment_date) = '2025'
AND MONTH(payment_date) = '04'
 LIMIT 1

    public function getPaymentsByCustomer($customerId)
    {
        $builder = $this->db->table($this->table);
        $builder->join('projects', 'projects.id = payments.project_id');
        $builder->where('projects.customer_id', $customerId);
        $query = $builder->get();
---
SELECT *
FROM `payments`
JOIN `projects` ON `projects`.`id` = `payments`.`project_id`
WHERE `projects`.`customer_id` = '1'

    private function getMonthlyExpensesTotal($year, $month)
    {
        // Bu fonksiyon gerçek bir uygulamada expenses tablosundan veri çekecektir
        // Şimdilik tahmini bir değer döndürüyoruz
        $builder = $this->db->table('projects');
        $builder->select('SUM(total_amount * 0.2) as total_expenses');
        $builder->where('YEAR(start_date)', $year);
        $builder->where('MONTH(start_date)', $month);
        $builder->where('status', 'Devam Ediyor');
        $query = $builder->get();
---
SELECT SUM(total_amount * 0.2) as total_expenses
FROM `projects`
WHERE YEAR(start_date) = 2024
AND MONTH(start_date) = 11
AND `status` = 'Devam Ediyor'

    public function getPaymentPerformanceAnalysis($year, $month)
    {
        $builder = $this->db->table('projects');
        $builder->select('projects.*,
                         customers.name as customer_name,
                         categories.name as category_name,
                         (projects.total_amount - projects.paid_amount) as remaining_amount,
                         DATEDIFF(CURRENT_DATE, projects.start_date) as days_since_start,
                         DATEDIFF(CURRENT_DATE, projects.end_date) as days_since_due');
        $builder->join('customers', 'customers.id = projects.customer_id');
        $builder->join('categories', 'categories.id = projects.category_id');
        $builder->where('YEAR(projects.start_date)', $year);
        if ($month != '00') {
            $builder->where('MONTH(projects.start_date)', $month);
        }
        $query = $builder->get();
---
SELECT `projects`.*, `customers`.`name` as `customer_name`, `categories`.`name` as `category_name`, (projects.total_amount - projects.paid_amount) as remaining_amount, DATEDIFF(CURRENT_DATE, projects.start_date) as days_since_start, DATEDIFF(CURRENT_DATE, projects.end_date) as days_since_due
FROM `projects`
JOIN `customers` ON `customers`.`id` = `projects`.`customer_id`
JOIN `categories` ON `categories`.`id` = `projects`.`category_id`
WHERE YEAR(projects.start_date) = '2025'
AND MONTH(projects.start_date) = '04'