app/Models/ProjectModel.php

    public function getMonthlyProjectCount($year, $month)
    {
        return $this->where('YEAR(start_date)', $year)
                    ->where('MONTH(start_date)', $month)
                    ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `projects`
WHERE YEAR(start_date) = '2025'
AND MONTH(start_date) = '04'

    public function getMonthlyCompletedProjectCount($year, $month)
    {
        return $this->where('YEAR(start_date)', $year)
                    ->where('MONTH(start_date)', $month)
                    ->where('status', 'Tamamlandı')
                    ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `projects`
WHERE YEAR(start_date) = '2025'
AND MONTH(start_date) = '04'
AND `status` = 'Tamamlandı'

    public function getMonthlyProjectAmount($year, $month)
    {
        $result = $this->selectSum('total_amount')
                      ->where('YEAR(start_date)', $year)
                      ->where('MONTH(start_date)', $month)
                      ->first();
---
SELECT SUM(`total_amount`) AS `total_amount`
FROM `projects`
WHERE YEAR(start_date) = '2025'
AND MONTH(start_date) = '04'
 LIMIT 1

    public function getYearlyProjectCount($year)
    {
        return $this->where('YEAR(start_date)', $year)
                    ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `projects`
WHERE YEAR(start_date) = '2025'

    public function getYearlyCompletedProjectCount($year)
    {
        return $this->where('YEAR(start_date)', $year)
                    ->where('status', 'Tamamlandı')
                    ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `projects`
WHERE YEAR(start_date) = '2025'
AND `status` = 'Tamamlandı'

    public function getYearlyProjectAmount($year)
    {
        $result = $this->selectSum('total_amount')
                      ->where('YEAR(start_date)', $year)
                      ->first();
---
SELECT SUM(`total_amount`) AS `total_amount`
FROM `projects`
WHERE YEAR(start_date) = '2025'
 LIMIT 1

    public function getProjectsByCustomer($customerId)
    {
        $builder = $this->db->table($this->table);
        $builder->where('customer_id', $customerId);
        $query = $builder->get();
---
SELECT *
FROM `projects`
WHERE `customer_id` = '1'

    public function getProjectsByCategory($categoryId)
    {
        return $this->where('category_id', $categoryId)->findAll();
---
SELECT *
FROM `projects`
WHERE `category_id` = '1'

    public function getProjectDurationAnalysis($year, $month)
    {
        $builder = $this->db->table($this->table);
        $builder->select('projects.*,
                         DATEDIFF(projects.end_date, projects.start_date) as planned_duration,
                         DATEDIFF(projects.updated_at, projects.start_date) as actual_duration,
                         DATEDIFF(projects.updated_at, projects.end_date) as delay_days');
        $builder->where('YEAR(projects.start_date)', $year);
        if ($month != '00') {
            $builder->where('MONTH(projects.start_date)', $month);
        }
        $builder->where('projects.status', 'Tamamlandı');
        $query = $builder->get();
---
SELECT `projects`.*, DATEDIFF(projects.end_date, projects.start_date) as planned_duration, DATEDIFF(projects.updated_at, projects.start_date) as actual_duration, DATEDIFF(projects.updated_at, projects.end_date) as delay_days
FROM `projects`
WHERE YEAR(projects.start_date) = '2025'
AND MONTH(projects.start_date) = '04'
AND `projects`.`status` = 'Tamamlandı'

    public function getDelayAnalysis($year, $month)
    {
        $builder = $this->db->table($this->table);
        $builder->select('projects.*,
                         DATEDIFF(projects.updated_at, projects.end_date) as delay_days,
                         categories.name as category_name,
                         customers.name as customer_name');
        $builder->join('categories', 'categories.id = projects.category_id');
        $builder->join('customers', 'customers.id = projects.customer_id');
        $builder->where('YEAR(projects.start_date)', $year);
        if ($month != '00') {
            $builder->where('MONTH(projects.start_date)', $month);
        }
        $builder->where('projects.status', 'Tamamlandı');
        $builder->where('projects.updated_at > projects.end_date');
        $query = $builder->get();
---
SELECT `projects`.*, DATEDIFF(projects.updated_at, projects.end_date) as delay_days, `categories`.`name` as `category_name`, `customers`.`name` as `customer_name`
FROM `projects`
JOIN `categories` ON `categories`.`id` = `projects`.`category_id`
JOIN `customers` ON `customers`.`id` = `projects`.`customer_id`
WHERE YEAR(projects.start_date) = '2025'
AND MONTH(projects.start_date) = '04'
AND `projects`.`status` = 'Tamamlandı'
AND `projects`.`updated_at` > `projects`.`end_date`

    public function getSeasonalTrends($year)
    {
        $builder = $this->db->table($this->table);
        $builder->select('MONTH(projects.start_date) as month,
                         COUNT(*) as project_count,
                         SUM(projects.total_amount) as total_amount,
                         COUNT(CASE WHEN projects.status = "Tamamlandı" THEN 1 END) as completed_count');
        $builder->where('YEAR(projects.start_date)', $year);
        $builder->groupBy('MONTH(projects.start_date)');
        $query = $builder->get();
---
SELECT MONTH(projects.start_date) as month, COUNT(*) as project_count, SUM(projects.total_amount) as total_amount, COUNT(CASE WHEN projects.status = "Tamamlandı" THEN 1 END) as completed_count
FROM `projects`
WHERE YEAR(projects.start_date) = '2025'
GROUP BY MONTH(projects.start_date)

    public function getBudgetOverrunAnalysis($year, $month)
    {
        $builder = $this->db->table('projects');
        $builder->select('projects.id, projects.name, projects.total_amount, projects.paid_amount, projects.start_date,
                         customers.name as customer_name,
                         categories.name as category_name,
                         (projects.total_amount - projects.paid_amount) as remaining_amount,
                         (projects.total_amount * 0.7) as estimated_cost,
                         ((projects.total_amount - (projects.total_amount * 0.7)) / (projects.total_amount * 0.7) * 100) as overrun_percentage');
        $builder->join('customers', 'customers.id = projects.customer_id');
        $builder->join('categories', 'categories.id = projects.category_id');
        $builder->where('YEAR(projects.start_date)', $year);
        if ($month != '00') {
            $builder->where('MONTH(projects.start_date)', $month);
        }
        $query = $builder->get();
---
SELECT `projects`.`id`, `projects`.`name`, `projects`.`total_amount`, `projects`.`paid_amount`, `projects`.`start_date`, `customers`.`name` as `customer_name`, `categories`.`name` as `category_name`, (projects.total_amount - projects.paid_amount) as remaining_amount, (projects.total_amount * 0.7) as estimated_cost, ((projects.total_amount - (projects.total_amount * 0.7)) / (projects.total_amount * 0.7) * 100) as overrun_percentage
FROM `projects`
JOIN `customers` ON `customers`.`id` = `projects`.`customer_id`
JOIN `categories` ON `categories`.`id` = `projects`.`category_id`
WHERE YEAR(projects.start_date) = '2025'
AND MONTH(projects.start_date) = '04'

    public function getProfitMarginAnalysis($year, $month)
    {
        $builder = $this->db->table($this->table);
        $builder->select('projects.*,
                         categories.name as category_name,
                         customers.name as customer_name,
                         (projects.total_amount - projects.paid_amount) as remaining_amount,
                         (projects.total_amount * 0.2) as estimated_cost,
                         (projects.total_amount - (projects.total_amount * 0.2)) as profit_margin,
                         ((projects.total_amount - (projects.total_amount * 0.2)) / projects.total_amount * 100) as profit_percentage');
        $builder->join('categories', 'categories.id = projects.category_id');
        $builder->join('customers', 'customers.id = projects.customer_id');
        $builder->where('YEAR(projects.start_date)', $year);
        if ($month != '00') {
            $builder->where('MONTH(projects.start_date)', $month);
        }
        $query = $builder->get();
---
SELECT `projects`.*, `categories`.`name` as `category_name`, `customers`.`name` as `customer_name`, (projects.total_amount - projects.paid_amount) as remaining_amount, (projects.total_amount * 0.2) as estimated_cost, (projects.total_amount - (projects.total_amount * 0.2)) as profit_margin, ((projects.total_amount - (projects.total_amount * 0.2)) / projects.total_amount * 100) as profit_percentage
FROM `projects`
JOIN `categories` ON `categories`.`id` = `projects`.`category_id`
JOIN `customers` ON `customers`.`id` = `projects`.`customer_id`
WHERE YEAR(projects.start_date) = '2025'
AND MONTH(projects.start_date) = '04'

    public function getKPIAnalysis($year, $month)
    {
        $builder = $this->db->table($this->table);
        $builder->select('projects.*,
                         DATEDIFF(projects.end_date, projects.start_date) as planned_duration,
                         DATEDIFF(COALESCE(projects.updated_at, CURRENT_DATE), projects.start_date) as actual_duration,
                         (projects.total_amount - projects.paid_amount) as remaining_amount,
                         (projects.total_amount * 0.7) as estimated_cost');
        $builder->where('YEAR(projects.start_date)', $year);
        if ($month != '00') {
            $builder->where('MONTH(projects.start_date)', $month);
        }
        $query = $builder->get();
---
SELECT `projects`.*, DATEDIFF(projects.end_date, projects.start_date) as planned_duration, DATEDIFF(COALESCE(projects.updated_at, CURRENT_DATE), projects.start_date) as actual_duration, (projects.total_amount - projects.paid_amount) as remaining_amount, (projects.total_amount * 0.7) as estimated_cost
FROM `projects`
WHERE YEAR(projects.start_date) = '2025'
AND MONTH(projects.start_date) = '04'

    public function getAllProjects()
    {
        $builder = $this->db->table($this->table);
        $builder->select('projects.*, customers.name as customer_name, categories.name as category_name');
        $builder->join('customers', 'customers.id = projects.customer_id');
        $builder->join('categories', 'categories.id = projects.category_id', 'left');
        return $builder->get()->getResultArray();
---
SELECT `projects`.*, `customers`.`name` as `customer_name`, `categories`.`name` as `category_name`
FROM `projects`
JOIN `customers` ON `customers`.`id` = `projects`.`customer_id`
LEFT JOIN `categories` ON `categories`.`id` = `projects`.`category_id`